int seg[7] = {2,3,4,5,6,7,8};

// 7-segment
//   a 
//f     b
//   g
//e     c
//   d
// 숫자 0~9까지
int num[10][7] = {
  {0,0,0,0,0,0,1}, //0
  {1,0,0,1,1,1,1}, //1
  {0,0,1,0,0,1,0}, //2
  {0,0,0,0,1,1,0},//3
  {1,0,0,1,1,0,0}, //4
  {0,1,0,0,1,0,0},//5
  {0,1,0,0,0,0,0}, //6
  {0,0,0,1,1,0,1},//7
  {0,0,0,0,0,0,0}, //8
  {0,0,0,1,1,0,0}  //9
};

void setup() {
  // 7개의 디지털 핀의 모드를 출력으로 변경
  for(int i = 0; i < 7; i++){
    pinMode(seg[i],OUTPUT);
  }
}

void loop() {
  // 0~9까지 나타내는 i
  for(int i = 0; i < 10; i++){
    // 7개의 세그먼트 led를 나타내는 j
    for(int j = 0; j < 7; j++){
      digitalWrite(seg[j], num[i][j]);
    }
    delay(1000);
  }
}